# DataFrame

DataFrame is labled 2-D array. It contains multiple rows and columns.

In [1]:
import pandas as pd
enos=[100,200,300,400]
enames=['Sunny','Bunny','Chinny','Vinny']
esals=[1000.0,2000.0,3000.0,4000.0]
eaddrs=['Hyderabad','Mumbai','Chennai','Delhi']
s=pd.Series(enames)
print(s)
print(s.ndim)
print(s.shape)

0     Sunny
1     Bunny
2    Chinny
3     Vinny
dtype: object
1
(4,)

In [7]:
import pandas as pd
enos=[100,200,300,400]
enames=['Sunny','Bunny','Chinny','Vinny']
esals=[1000.0,2000.0,3000.0,4000.0]
eaddrs=['Hyderabad','Mumbai','Chennai','Delhi']
s=pd.Series(enames)
print(s)
print(s.ndim)
print(s.shape)

df=pd.DataFrame({'eno':enos,'ename':enames,'esal':esals,'eaddr':eaddrs})
print(df)
print(df.ndim)
print(df.ename)
print(df.shape)
print(type(df.ename))

0     Sunny
1     Bunny
2    Chinny
3     Vinny
dtype: object
1
(4,)
   eno   ename    esal      eaddr
0  100   Sunny  1000.0  Hyderabad
1  200   Bunny  2000.0     Mumbai
2  300  Chinny  3000.0    Chennai
3  400   Vinny  4000.0      Delhi
2
0     Sunny
1     Bunny
2    Chinny
3     Vinny
Name: ename, dtype: object
(4, 4)
<class 'pandas.core.series.Series'>

In [13]:
import pandas as pd
enos=[100,200,300,400]
enames=['Sunny','Bunny','Chinny','Vinny']
esals=[1000.0,2000.0,3000.0,4000.0]
eaddrs=['Hyderabad','Mumbai','Chennai','Delhi']
s=pd.Series(enames)
print(s.dtype)

df=pd.DataFrame({'eno':enos,'ename':enames,'esal':esals,'eaddr':eaddrs})
# print(df.dtype) -AttributeError: 'DataFrame' object has no attribute 'dtype'
print(df.dtypes)

object
eno        int64
ename     object
esal     float64
eaddr     object
dtype: object

Note:
    'dtype' attribute is applicable only for Series object but not for DataFarme. But we can use 'dtypes' attribute for DatFrame

## DataFrame Construction

#### 1. From dict of list objects:
       - Here each keys acts as columns and list of values for the columns.

In [14]:
import pandas as pd
enos=[100,200,300,400]
enames=['Sunny','Bunny','Chinny','Vinny']
esals=[1000.0,2000.0,3000.0,4000.0]
eaddrs=['Hyderabad','Mumbai','Chennai','Delhi']
s=pd.Series(enames)

df=pd.DataFrame({'eno':enos,'ename':enames,'esal':esals,'eaddr':eaddrs})
print(df)

   eno   ename    esal      eaddr
0  100   Sunny  1000.0  Hyderabad
1  200   Bunny  2000.0     Mumbai
2  300  Chinny  3000.0    Chennai
3  400   Vinny  4000.0      Delhi

#### 2. From dict of tuple

In [15]:
import pandas as pd
enos=(100,200,300,400)
enames=('Sunny','Bunny','Chinny','Vinny')
esals=(1000.0,2000.0,3000.0,4000.0)
eaddrs=('Hyderabad','Mumbai','Chennai','Delhi')
s=pd.Series(enames)

df=pd.DataFrame({'eno':enos,'ename':enames,'esal':esals,'eaddr':eaddrs})
print(df)

   eno   ename    esal      eaddr
0  100   Sunny  1000.0  Hyderabad
1  200   Bunny  2000.0     Mumbai
2  300  Chinny  3000.0    Chennai
3  400   Vinny  4000.0      Delhi

#### 3. From Dict of Series object

In [16]:
import pandas as pd
enos=pd.Series([100,200,300,400])
enames=pd.Series(['Sunny','Bunny','Chinny','Vinny'])
esals=pd.Series([1000.0,2000.0,3000.0,4000.0])
eaddrs=pd.Series(['Hyderabad','Mumbai','Chennai','Delhi'])

df=pd.DataFrame({'eno':enos,'ename':enames,'esal':esals,'eaddr':eaddrs})
print(df)

   eno   ename    esal      eaddr
0  100   Sunny  1000.0  Hyderabad
1  200   Bunny  2000.0     Mumbai
2  300  Chinny  3000.0    Chennai
3  400   Vinny  4000.0      Delhi

#### 4. From Dict of dict

In [18]:
import pandas as pd
df=pd.DataFrame({'eno':{0:100,1:200,2:300,3:400},
                 'ename':{0:'Sunny',1:'Bunny',2:'Chinny',3:'Vinny'},
                 'esal':{0:1000.0,1:2000.0,2:3000.0,3:4000.0},
                 'eaddr':{0:'Hyderabad',1:'Mumbai',2:'Chennai',3:'Delhi'}
                })
print(df)

   eno   ename    esal      eaddr
0  100   Sunny  1000.0  Hyderabad
1  200   Bunny  2000.0     Mumbai
2  300  Chinny  3000.0    Chennai
3  400   Vinny  4000.0      Delhi

In [20]:
import pandas as pd
enos=[100,200,300,400]
enames=['Sunny','Bunny','Chinny','Vinny']
esals=[1000.0,2000.0,3000.0,4000.0]
eaddrs=['Hyderabad','Mumbai','Chennai','Delhi']

def built_dict(l):
    d={k:v for k,v in enumerate (l)}
    return d

df=pd.DataFrame({'eno':built_dict(enos),
                 'ename':built_dict(enames),
                 'esal':built_dict(esals),
                 'eaddr':built_dict(eaddrs)
                })
print(df)

   eno   ename    esal      eaddr
0  100   Sunny  1000.0  Hyderabad
1  200   Bunny  2000.0     Mumbai
2  300  Chinny  3000.0    Chennai
3  400   Vinny  4000.0      Delhi

#### 5. from list of dicts

In [21]:
import pandas as pd
df= pd.DataFrame([{'eno':100,'ename':'Sunny','esal':1000.0,'eaddr':'Hyderabad'},
                  {'eno':200,'ename':'bunny','esal':2000.0,'eaddr':'Mumbai'},
                  {'eno':300,'ename':'chinny','esal':3000.0,'eaddr':'Chennai'},
                  {'eno':400,'ename':'Vinny','esal':4000.0,'eaddr':'Delhi'}
                 
                 ])
print(df)

   eno   ename    esal      eaddr
0  100   Sunny  1000.0  Hyderabad
1  200   bunny  2000.0     Mumbai
2  300  chinny  3000.0    Chennai
3  400   Vinny  4000.0      Delhi

In [23]:
a=[10,20,30]
b=['a','b','c']
for k,v in zip(a,b):
    print(f'{k}-->{v}')
print(zip(a,b))

10-->a
20-->b
30-->c
<zip object at 0x00000168816E77C0>

In [4]:
import pandas as pd
enos=[100,200,300,400]
enames=['Sunny','Bunny','Chinny','Vinny']
esals=[1000.0,2000.0,3000.0,4000.0]
eaddrs=['Hyderabad','Mumbai','Chennai','Delhi']

row_wise_data=[{'eno':eno,'ename':ename,'esal':esal,'eaddr':eaddr} for 
               eno,ename,esal,eaddr in zip(enos,enames,esals,eaddrs)]
print(row_wise_data)
df= pd.DataFrame(row_wise_data)
print(df)

[{'eno': 100, 'ename': 'Sunny', 'esal': 1000.0, 'eaddr': 'Hyderabad'}, {'eno': 200, 'ename': 'Bunny', 'esal': 2000.0, 'eaddr': 'Mumbai'}, {'eno': 300, 'ename': 'Chinny', 'esal': 3000.0, 'eaddr': 'Chennai'}, {'eno': 400, 'ename': 'Vinny', 'esal': 4000.0, 'eaddr': 'Delhi'}]
   eno   ename    esal      eaddr
0  100   Sunny  1000.0  Hyderabad
1  200   Bunny  2000.0     Mumbai
2  300  Chinny  3000.0    Chennai
3  400   Vinny  4000.0      Delhi

#### 6. From numpy ndarray

In [5]:
import pandas as pd
import numpy as np
df= pd.DataFrame(np.array([[1,2,3],[3,4,5],[7,8,9]]),columns =['a','b','c'])
print(df)

   a  b  c
0  1  2  3
1  3  4  5
2  7  8  9

#### Importing csv

In [20]:
import pandas as pd
df= pd.read_csv('city_loc.csv',index_col=['Year'])
print(df)

                City  latitude  longitude
Year
1896          athens  34.80243  -86.97219
1900           paris  48.85341    2.34880
1904       st. louis  38.62727  -90.19789
1908          london  42.98339  -81.23304
1912       stockholm  59.33258   18.06490
1920       antwerpen  51.21989    4.40346
1924           paris  48.85341    2.34880
1928       amsterdam  52.37403    4.88969
1932     los angeles -37.46973  -72.35366
1936          berlin  52.52437   13.41053
1948          london  42.98339  -81.23304
1952        helsinki  60.16952   24.93545
1956       stockholm  59.33258   18.06490
1956       melbourne -37.81400  144.96332
1960            rome  34.25704  -85.16467
1964           tokyo  35.68950  139.69171
1968     mexico city  19.42847  -99.12766
1972          munich  48.13743   11.57549
1976        montreal  45.50884  -73.58781
1980          moscow  55.75222   37.61556
1984     los angeles  34.05223 -118.24368
1988           seoul  37.56600  126.97840
1992       barcelona  41.38879    2.15899
1996         atlanta  33.74900  -84.38798
2000          sydney -33.86785  151.20732
2004          athens  39.32924  -82.10126
2008         beijing  39.90750  116.39723
2012          london  51.50853   -0.12574
2016  rio de janeiro -22.90278  -43.20750

In [3]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
print(df.head(n=3))

   Year       City  latitude  longitude
0  1896     athens  34.80243  -86.97219
1  1900      paris  48.85341    2.34880
2  1904  st. louis  38.62727  -90.19789

In [4]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
print(df.tail(n=3))

    Year            City  latitude  longitude
26  2008         beijing  39.90750  116.39723
27  2012          london  51.50853   -0.12574
28  2016  rio de janeiro -22.90278  -43.20750

In [22]:
import pandas as pd
df= pd.read_csv('city_loc.csv',index_col='Year')
print(df.shape)
print(df.ndim)
print(df.index)
print(df.values)

(29, 3)
2
Int64Index([1896, 1900, 1904, 1908, 1912, 1920, 1924, 1928, 1932, 1936, 1948,
            1952, 1956, 1956, 1960, 1964, 1968, 1972, 1976, 1980, 1984, 1988,
            1992, 1996, 2000, 2004, 2008, 2012, 2016],
           dtype='int64', name='Year')
[['athens' 34.80243 -86.97219]
 ['paris' 48.85341 2.3488]
 ['st. louis' 38.62727 -90.19789]
 ['london' 42.98339 -81.23304]
 ['stockholm' 59.33258 18.0649]
 ['antwerpen' 51.21989 4.40346]
 ['paris' 48.85341 2.3488]
 ['amsterdam' 52.37403 4.88969]
 ['los angeles' -37.46973 -72.35366]
 ['berlin' 52.52437 13.41053]
 ['london' 42.98339 -81.23304]
 ['helsinki' 60.16952 24.93545]
 ['stockholm' 59.33258 18.0649]
 ['melbourne' -37.814 144.96332]
 ['rome' 34.25704 -85.16467]
 ['tokyo' 35.6895 139.69171]
 ['mexico city' 19.42847 -99.12766]
 ['munich' 48.13743 11.57549]
 ['montreal' 45.50884 -73.58781]
 ['moscow' 55.75222 37.61556]
 ['los angeles' 34.05223 -118.24368]
 ['seoul' 37.566 126.9784]
 ['barcelona' 41.38879 2.15899]
 ['atlanta' 33.749 -84.38798]
 ['sydney' -33.86785 151.20732]
 ['athens' 39.32924 -82.10126]
 ['beijing' 39.9075 116.39723]
 ['london' 51.50853 -0.12574]
 ['rio de janeiro' -22.90278 -43.2075]]

In [23]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       29 non-null     int64
 1   City       29 non-null     object
 2   latitude   29 non-null     float64
 3   longitude  29 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 1.0+ KB
None

In [24]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       29 non-null     int64
 1   City       29 non-null     object
 2   latitude   29 non-null     float64
 3   longitude  29 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 1.0+ KB

In [25]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
df.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       29 non-null     int64
 1   City       29 non-null     object
 2   latitude   29 non-null     float64
 3   longitude  29 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 1.0+ KB

In [26]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
df.info(verbose=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Columns: 4 entries, Year to longitude
dtypes: float64(2), int64(1), object(1)
memory usage: 1.0+ KB

In [28]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
df.info(verbose=False,show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Columns: 4 entries, Year to longitude
dtypes: float64(2), int64(1), object(1)
memory usage: 1.0+ KB

In [30]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
df.sample(n=5)

    Year       City  latitude  longitude
22  1992  barcelona  41.38879    2.15899
1   1900      paris  48.85341    2.34880
23  1996    atlanta  33.74900  -84.38798
2   1904  st. louis  38.62727  -90.19789
19  1980     moscow  55.75222   37.61556

In [32]:
import pandas as pd
df= pd.read_csv('city_loc.csv',index_col=['Year'])
df.sample(n=5)

             City  latitude  longitude
Year
1992    barcelona  41.38879    2.15899
2004       athens  39.32924  -82.10126
1932  los angeles -37.46973  -72.35366
2008      beijing  39.90750  116.39723
1920    antwerpen  51.21989    4.40346

In [33]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
print(df.dtypes)

Year           int64
City          object
latitude     float64
longitude    float64
dtype: object

In [37]:
import pandas as pd
df= pd.read_csv('smartphones_cleaned_v6.csv')
print(df.dtypes.value_counts())
print(df.head())

float64    12
int64       7
object      4
bool        3
dtype: int64
  brand_name                      model  price  rating  has_5g  has_nfc  \
0    oneplus              OnePlus 11 5G  54999    89.0    True     True
1    oneplus  OnePlus Nord CE 2 Lite 5G  19989    81.0    True    False
2    samsung      Samsung Galaxy A14 5G  16499    75.0    True    False
3   motorola       Motorola Moto G62 5G  14999    81.0    True    False
4     realme         Realme 10 Pro Plus  24999    82.0    True    False

   has_ir_blaster processor_brand  num_cores  processor_speed  ...  \
0           False      snapdragon        8.0              3.2  ...
1           False      snapdragon        8.0              2.2  ...
2           False          exynos        8.0              2.4  ...
3           False      snapdragon        8.0              2.2  ...
4           False       dimensity        8.0              2.6  ...

   refresh_rate  num_rear_cameras  num_front_cameras       os  \
0           120                 3                1.0  android
1           120                 3                1.0  android
2            90                 3                1.0  android
3           120                 3                1.0  android
4           120                 3                1.0  android

   primary_camera_rear  primary_camera_front  extended_memory_available  \
0                 50.0                  16.0                          0
1                 64.0                  16.0                          1
2                 50.0                  13.0                          1
3                 50.0                  16.0                          1
4                108.0                  16.0                          0

   extended_upto  resolution_width resolution_height
0            NaN              1440              3216
1         1024.0              1080              2412
2         1024.0              1080              2408
3         1024.0              1080              2400
4            NaN              1080              2412

[5 rows x 26 columns]

#### Attribute and methods only applicable on the DataFrame but not in Series

Attributes:
    1. dtypes
    2. columns
    3. axes
Methods:
    1. info()
    2. sample()

In [42]:
import pandas as pd
import numpy as np
ndarray=np.array([[10,20,30],[40,50,60],[70,80,90]])
df=pd.DataFrame(ndarray,columns=[['c1','c2','c3']])
print(df)

   c1  c2  c3
0  10  20  30
1  40  50  60
2  70  80  90

In [43]:
import pandas as pd
import numpy as np
ndarray=np.array([[10,20,30],[40,50,60],[70,80,90]])
df=pd.DataFrame(ndarray,columns=[['c1','c2','c3']])
print(df.dtypes)

c1    int32
c2    int32
c3    int32
dtype: object

In [44]:
import pandas as pd
import numpy as np
ndarray=np.array([[10,20,30],[40,50,60],[70,80,90]])
df=pd.DataFrame(ndarray,columns=[['c1','c2','c3']])
#print(df.dtypes)
print(df.columns)

MultiIndex([('c1',),
            ('c2',),
            ('c3',)],
           )

In [45]:
import pandas as pd
import numpy as np
ndarray=np.array([[10,20,30],[40,50,60],[70,80,90]])
df=pd.DataFrame(ndarray,columns=[['c1','c2','c3']])
#print(df.dtypes)
#print(df.columns)
print(df.axes)

[RangeIndex(start=0, stop=3, step=1), MultiIndex([('c1',),
            ('c2',),
            ('c3',)],
           )]

In [49]:
import pandas as pd
import numpy as np
ndarray=np.array([[10,20,30],[40,50,60],[70,80,90]])
df=pd.DataFrame(ndarray,columns=[['c1','c2','c3']])
#print(df.dtypes)
#print(df.columns)
#print(df.axes)
print(df.sample(n=2))

   c1  c2  c3
0  10  20  30
1  40  50  60

In [50]:
import pandas as pd
import numpy as np
ndarray=np.array([[10,20,30],[40,50,60],[70,80,90]])
df=pd.DataFrame(ndarray,columns=[['c1','c2','c3']])
#print(df.dtypes)
#print(df.columns)
#print(df.axes)
#print(df.sample(n=2))
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   (c1,)   3 non-null      int32
 1   (c2,)   3 non-null      int32
 2   (c3,)   3 non-null      int32
dtypes: int32(3)
memory usage: 164.0 bytes
None

#### Selecting columns from dataframe
    1. selection of one column
       - df.column_name
       - df['column_name'] # most recomended as name contains space it will give error eg.'ram niwash'
    2. selection of multiple columns
       - df['column_name1','column_name2',...]

In [52]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
df.head()
print(df.City) # getting single column

0             athens
1              paris
2          st. louis
3             london
4          stockholm
5          antwerpen
6              paris
7          amsterdam
8        los angeles
9             berlin
10            london
11          helsinki
12         stockholm
13         melbourne
14              rome
15             tokyo
16       mexico city
17            munich
18          montreal
19            moscow
20       los angeles
21             seoul
22         barcelona
23           atlanta
24            sydney
25            athens
26           beijing
27            london
28    rio de janeiro
Name: City, dtype: object

In [53]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
df.head()
print(df['City']) # getting single column

0             athens
1              paris
2          st. louis
3             london
4          stockholm
5          antwerpen
6              paris
7          amsterdam
8        los angeles
9             berlin
10            london
11          helsinki
12         stockholm
13         melbourne
14              rome
15             tokyo
16       mexico city
17            munich
18          montreal
19            moscow
20       los angeles
21             seoul
22         barcelona
23           atlanta
24            sydney
25            athens
26           beijing
27            london
28    rio de janeiro
Name: City, dtype: object

In [56]:
import pandas as pd
df= pd.read_csv('city_loc.csv',)
df.head()

print(df[['City','latitude']]) # getting multiple column

              City  latitude
0           athens  34.80243
1            paris  48.85341
2        st. louis  38.62727
3           london  42.98339
4        stockholm  59.33258
5        antwerpen  51.21989
6            paris  48.85341
7        amsterdam  52.37403
8      los angeles -37.46973
9           berlin  52.52437
10          london  42.98339
11        helsinki  60.16952
12       stockholm  59.33258
13       melbourne -37.81400
14            rome  34.25704
15           tokyo  35.68950
16     mexico city  19.42847
17          munich  48.13743
18        montreal  45.50884
19          moscow  55.75222
20     los angeles  34.05223
21           seoul  37.56600
22       barcelona  41.38879
23         atlanta  33.74900
24          sydney -33.86785
25          athens  39.32924
26         beijing  39.90750
27          london  51.50853
28  rio de janeiro -22.90278

#### Airthmatic Operation on the dataframe

we can't apply airthmatic operation directly on DataFrame object because it conatins multiple columns.
But we can perform airthmatic operation by selecting a particular column of DataFrame, because each Dataframe is collection of the series object.

The allowed airthmatic operation are:
    1. df['column']+500 or df['column'].add(500)
    1. df['column']-500 or df['column'].sub(500)    
    1. df['column']*2 or df['column'].mul(500)    
    1. df['column']/2 or df['column'].div(500)

In [60]:
import pandas as pd
df=pd.read_csv('emp.csv')

# add 500 value to the Esal column values
print(df['Esal']+500)
print(df)

0     10500
1     20500
2     30500
3     40500
4     50500
5     19500
6    100500
Name: Esal, dtype: int64
   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram

In [61]:
import pandas as pd
df=pd.read_csv('emp.csv')

# add 500 value to the Esal column values
print(df['Esal'].add(500))
print(df)

0     10500
1     20500
2     30500
3     40500
4     50500
5     19500
6    100500
Name: Esal, dtype: int64
   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram

#### Adding new coulumn to the DataFrame

1. df['column']=Value :
    -If the specified column is alraedy available then every value will be replaced by our provided value.
    -If the Specified column is not avilable then a new columnn, will be added to the DataFrame with provided value
    
2. df.insert(loc,column,value)  :
    -Inserted column into DataFrame at specified location.
    -Raised a value Error if the column is already contained in the DataFrame,unless allows Duplicate is set as true

In [62]:
import pandas as pd
df=pd.read_csv('emp.csv')
print(df)
print('-'*50)
df['Esal']=999 # providing salary 999 in each value to the Esal column
print(df)

   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram
--------------------------------------------------
   ENO    Ename  Esal      Eaddr
0  100    bunny   999  hyderabad
1  200    sunny   999      delhi
2  300     rani   999       pune
3  400  srikant   999   banglore
4  500    krish   999      patna
5  600   deepak   999     bokaro
6  700   pushpa   999   gurugram

In [64]:
import pandas as pd
df=pd.read_csv('emp.csv')
print(df)
print('-'*50)
df['Esal']=999
print(df)
df['Country']='India'
print(df)

   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram
--------------------------------------------------
   ENO    Ename  Esal      Eaddr
0  100    bunny   999  hyderabad
1  200    sunny   999      delhi
2  300     rani   999       pune
3  400  srikant   999   banglore
4  500    krish   999      patna
5  600   deepak   999     bokaro
6  700   pushpa   999   gurugram
   ENO    Ename  Esal      Eaddr Country
0  100    bunny   999  hyderabad   India
1  200    sunny   999      delhi   India
2  300     rani   999       pune   India
3  400  srikant   999   banglore   India
4  500    krish   999      patna   India
5  600   deepak   999     bokaro   India
6  700   pushpa   999   gurugram   India

In [69]:
import pandas as pd
df=pd.read_csv('emp.csv')
print(df)
print('-'*50)
df['Esal']=999
print(df)
print('-'*50)
df['Country']='India'
df['State']=['bihar','Odisha','Delhi','Jharkhand','Karnataka','Uttar Pradseh','Panjab'] 
# the number of valuecolumn  should be same as the value in the column  
print(df)

   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram
--------------------------------------------------
   ENO    Ename  Esal      Eaddr
0  100    bunny   999  hyderabad
1  200    sunny   999      delhi
2  300     rani   999       pune
3  400  srikant   999   banglore
4  500    krish   999      patna
5  600   deepak   999     bokaro
6  700   pushpa   999   gurugram
--------------------------------------------------
   ENO    Ename  Esal      Eaddr Country          State
0  100    bunny   999  hyderabad   India          bihar
1  200    sunny   999      delhi   India         Odisha
2  300     rani   999       pune   India          Delhi
3  400  srikant   999   banglore   India      Jharkhand
4  500    krish   999      patna   India      Karnataka
5  600   deepak   999     bokaro   India  Uttar Pradseh
6  700   pushpa   999   gurugram   India         Panjab

In [72]:
import pandas as pd
df=pd.read_csv('emp.csv')
print(df)
#df.insert(1,'Esal',999) # error as Esal is already available in the DataFrame
df.insert(1,'Country','India') # adding a new column in the 1 index of the as country
f.insert(1,'Esal',999)
print(df)

   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram
   ENO Country    Ename    Esal      Eaddr
0  100   India    bunny   10000  hyderabad
1  200   India    sunny   20000      delhi
2  300   India     rani   30000       pune
3  400   India  srikant   40000   banglore
4  500   India    krish   50000      patna
5  600   India   deepak   19000     bokaro
6  700   India   pushpa  100000   gurugram

In [74]:
import pandas as pd
df=pd.read_csv('emp.csv')
print(df)
#df.insert(1,'Esal',999) # error as Esal is already available in the DataFrame
df.insert(1,'States',['bihar','Odisha','Delhi','Jharkhand','Karnataka','Uttar Pradseh','Panjab'] ) # adding a new column in the 1 index of the as country
df.insert(1,'Country','India')
print(df)

   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram
   ENO Country         States    Ename    Esal      Eaddr
0  100   India          bihar    bunny   10000  hyderabad
1  200   India         Odisha    sunny   20000      delhi
2  300   India          Delhi     rani   30000       pune
3  400   India      Jharkhand  srikant   40000   banglore
4  500   India      Karnataka    krish   50000      patna
5  600   India  Uttar Pradseh   deepak   19000     bokaro
6  700   India         Panjab   pushpa  100000   gurugram

In [75]:
import pandas as pd
df=pd.read_csv('emp.csv')
print(df)
# add in 500 bonus to the salary 
df['Esal']=df['Esal']+500
print('-'*50)
print(df)

   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram
--------------------------------------------------
   ENO    Ename    Esal      Eaddr
0  100    bunny   10500  hyderabad
1  200    sunny   20500      delhi
2  300     rani   30500       pune
3  400  srikant   40500   banglore
4  500    krish   50500      patna
5  600   deepak   19500     bokaro
6  700   pushpa  100500   gurugram

In [77]:
import pandas as pd
df=pd.read_csv('emp.csv')
print(df)
# add in 500 bonus to the salary 
df['Esal']=df['Esal']+500
print('-'*50)
print(df)
print('-'*50)
df['Esal']=df['Esal']/2
print(df)

   ENO    Ename    Esal      Eaddr
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak   19000     bokaro
6  700   pushpa  100000   gurugram
--------------------------------------------------
   ENO    Ename    Esal      Eaddr
0  100    bunny   10500  hyderabad
1  200    sunny   20500      delhi
2  300     rani   30500       pune
3  400  srikant   40500   banglore
4  500    krish   50500      patna
5  600   deepak   19500     bokaro
6  700   pushpa  100500   gurugram
--------------------------------------------------
   ENO    Ename     Esal      Eaddr
0  100    bunny   5250.0  hyderabad
1  200    sunny  10250.0      delhi
2  300     rani  15250.0       pune
3  400  srikant  20250.0   banglore
4  500    krish  25250.0      patna
5  600   deepak   9750.0     bokaro
6  700   pushpa  50250.0   gurugram

#### How to Drop DataFrame rows with missing Values/ null values


dropnna() method

DataFrame.dropna(*, axis=0, 
                  how=_NoDefault.no_default, 
                  thresh=_NoDefault.no_default,
                  subset=None, inplace=False)

        Remove missing values.
By Default it remove rows  from the dataframe where row, contains at least one missing values.

In [79]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN

In [80]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)
print('-'*50)
print(df.dropna()) # Deleting all rows which are having atleast one missing or null value

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN
--------------------------------------------------
     ENO    ENAME     ESAL      EADDR
0  100.0    bunny  10000.0  hyderabad
1  200.0    sunny  20000.0      delhi
2  300.0     rani  30000.0       pune
3  400.0  srikant  40000.0   banglore
4  500.0    krish  50000.0      patna

##### 'how' parameter

how{‘any’, ‘all’}, default ‘any’

Determine if row or column is removed from DataFrame, when we have at least one NA or all NA.
   ‘any’ : If any NA values are present, drop that row or column.
   ‘all’ : If all values are NA, drop that row or column.

In [81]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)
print('-'*50)
print(df.dropna(how='all')) # deleting the rows which are having all value rows are null

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN
--------------------------------------------------
     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN

In [82]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)
print('-'*50)
print(df.dropna(how='any')) # any null found in rows or column are deleted  rows

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN
--------------------------------------------------
     ENO    ENAME     ESAL      EADDR
0  100.0    bunny  10000.0  hyderabad
1  200.0    sunny  20000.0      delhi
2  300.0     rani  30000.0       pune
3  400.0  srikant  40000.0   banglore
4  500.0    krish  50000.0      patna

##### Inplace parameter

BY default dropna() method return a new DataFrame. Instead of Creating new dataframe to remove missing value in the existing Dataframe only we have to use inplace=True.
Whether to modify the DataFrame rather than creating a new one.

In [83]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)
print('-'*50)
print(df.dropna(how='any')) # here by default inplace = False so no change in the existing dataframe
print(df)

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN
--------------------------------------------------
     ENO    ENAME     ESAL      EADDR
0  100.0    bunny  10000.0  hyderabad
1  200.0    sunny  20000.0      delhi
2  300.0     rani  30000.0       pune
3  400.0  srikant  40000.0   banglore
4  500.0    krish  50000.0      patna
     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN

In [84]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)
print('-'*50)
print(df.dropna(how='any',inplace=True))#  here by default inplace = True so change in the existing dataframe it return none
print(df)

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN
--------------------------------------------------
None
     ENO    ENAME     ESAL      EADDR
0  100.0    bunny  10000.0  hyderabad
1  200.0    sunny  20000.0      delhi
2  300.0     rani  30000.0       pune
3  400.0  srikant  40000.0   banglore
4  500.0    krish  50000.0      patna

##### Subset Parameter

To delete rows iff a particular column has the missing values

1. df.dropna(subset=['ESAL'])- if Easl contains missing value then only delete that rows.
2. df.dropna(subset=['ESAL','ENAME'])- if ESAL or ENAME contain missing value, then only delete that rows

In [85]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)
print('-'*50)
df.dropna(subset='ESAL',inplace=True)# deleting row (5,7) in the ESAL rows having the 
print(df)

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN
--------------------------------------------------
     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
6  700.0   pushpa  100000.0        NaN

In [86]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)
print('-'*50)
df.dropna(subset=['ESAL','EADDR'],inplace=True)# deleting row (5,7) in the ESAL rows having the 
print(df)

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN
--------------------------------------------------
     ENO    ENAME     ESAL      EADDR
0  100.0    bunny  10000.0  hyderabad
1  200.0    sunny  20000.0      delhi
2  300.0     rani  30000.0       pune
3  400.0  srikant  40000.0   banglore
4  500.0    krish  50000.0      patna

##### To delete columns that are having missing values use(axis parameter)

axis{0 or ‘index’, 1 or ‘columns’}, default 0
  
    Determine if rows or columns which contain missing values are removed.

    0, or ‘index’ : Drop rows which contain missing values.
    1, or ‘columns’ : Drop columns which contain missing value.

In [88]:
import pandas as pd
df=pd.read_csv('emp1.csv')
print(df)
print('-'*50)
df.dropna(axis=1,inplace=True)# deleting all columns since at 7th rows having all the null values 
print(df)

     ENO    ENAME      ESAL      EADDR
0  100.0    bunny   10000.0  hyderabad
1  200.0    sunny   20000.0      delhi
2  300.0     rani   30000.0       pune
3  400.0  srikant   40000.0   banglore
4  500.0    krish   50000.0      patna
5  600.0   deepak       NaN     bokaro
6  700.0   pushpa  100000.0        NaN
7    NaN      NaN       NaN        NaN
--------------------------------------------------
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [89]:
import pandas as pd
df=pd.read_csv('emp2.csv')
print(df)
print('-'*50)
df.dropna(axis=1,inplace=True)# deleting all columns since at 7th rows having all the null values 
print(df)

   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       NaN     bokaro
6  700   pushpa  100000.0        NaN
--------------------------------------------------
   ENO    ENAME
0  100    bunny
1  200    sunny
2  300     rani
3  400  srikant
4  500    krish
5  600   deepak
6  700   pushpa

#### How to fill missing/null values with our required values in DataFrame:
fillna()

DataFrame.fillna(value=None, *, method=None, axis=None, inplace=False, limit=None, downcast=None)

     Fill NA/NaN values using the specified method.

In [91]:
import pandas as pd
df=pd.read_csv('emp3.csv')
print(df)
print('-'*50)
df1=df.fillna(0)
print(df1)

   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       NaN     bokaro
6  700   pushpa  100000.0        NaN
7  800      NaN       NaN        NaN
--------------------------------------------------
   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       0.0     bokaro
6  700   pushpa  100000.0          0
7  800        0       0.0          0

Note:
    Replacing missing value for ESAL column with 0 is meaningful. But replacing missing value for ENAME and EADDR column with 0 is not meaningful.

##### If columns with different types

Replacing every missing value in ENAME column with 'Durga' in EADDR column with Hyderabad and in ESAL column with 0

     -ENAME--->Durga
     -EADDR--->Hyderbad
     -ESAL---->0

we can replace provided different replacement value for different columns based on columns datatype.

In [93]:
import pandas as pd
df=pd.read_csv('emp3.csv')
print(df)
print('-'*50)
#df['ENAME']=df['ENAME'].fillna('Durga')
df['ENAME'].fillna('Durga',inplace=True) # more recomended
print(df) # replacing 8th row ename as durga from nan value

   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       NaN     bokaro
6  700   pushpa  100000.0        NaN
7  800      NaN       NaN        NaN
--------------------------------------------------
   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       NaN     bokaro
6  700   pushpa  100000.0        NaN
7  800    Durga       NaN        NaN

In [94]:
import pandas as pd
df=pd.read_csv('emp3.csv')
print(df)
print('-'*50)

df['ENAME'].fillna('Durga',inplace=True) 
df['EADDR'].fillna('Hyderabad',inplace=True)
df['ESAL'].fillna(0,inplace=True)
print(df)

   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       NaN     bokaro
6  700   pushpa  100000.0        NaN
7  800      NaN       NaN        NaN
--------------------------------------------------
   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       0.0     bokaro
6  700   pushpa  100000.0  Hyderabad
7  800    Durga       0.0  Hyderabad

#### How to convert DataFrame column type with as astype() method:
   The main advantage of astype() method is we can improve memeory utilization

DataFrame.astype(dtype, copy=True, errors='raise')
Cast a pandas object to a specified dtype

In [96]:
import pandas as pd
df=pd.read_csv('emp3.csv')
print(df)
print('-'*50)
df.fillna(0,inplace=True)# as NaN is float value type and it reserve more memory so it converted to 0.0
print(df) 
print('-'*50)
df['ESAL']=df['ESAL'].astype('int') 
# here with the help of astype 0.0 in ESAL converted to 0 int type it reduce the memeory allocation
print(df)

   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       NaN     bokaro
6  700   pushpa  100000.0        NaN
7  800      NaN       NaN        NaN
--------------------------------------------------
   ENO    ENAME      ESAL      EADDR
0  100    bunny   10000.0  hyderabad
1  200    sunny   20000.0      delhi
2  300     rani   30000.0       pune
3  400  srikant   40000.0   banglore
4  500    krish   50000.0      patna
5  600   deepak       0.0     bokaro
6  700   pushpa  100000.0          0
7  800        0       0.0          0
--------------------------------------------------
   ENO    ENAME    ESAL      EADDR
0  100    bunny   10000  hyderabad
1  200    sunny   20000      delhi
2  300     rani   30000       pune
3  400  srikant   40000   banglore
4  500    krish   50000      patna
5  600   deepak       0     bokaro
6  700   pushpa  100000          0
7  800        0       0          0

##### 'category' type

If a column contains same valuemultiple times. It is not recommended to create seperated copy of that value every time. It reduce memory utilization.

eg. hyderabad is eaddr value for multiple employees.

instead of creating same value multiple times, we can create only once and we can reuse same value every time, we can reuse same value every time where it is requied.
This approach improvies memory utilazation. 

we can do this by using 'category' type.

In [97]:
import pandas as pd
df=pd.read_csv('emp4.csv')
df.info()
print('-'*50)
df['EADDR']=df['EADDR'].astype('category')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 864 entries, 0 to 863
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ENO     864 non-null    int64
 1   ENAME   864 non-null    object
 2   ESAL    864 non-null    int64
 3   EADDR   864 non-null    object
dtypes: int64(2), object(2)
memory usage: 27.1+ KB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 864 entries, 0 to 863
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ENO     864 non-null    int64
 1   ENAME   864 non-null    object
 2   ESAL    864 non-null    int64
 3   EADDR   864 non-null    category
dtypes: category(1), int64(2), object(1)
memory usage: 21.6+ KB

#### How to sort values of DataFrame

DataFrame.sort_values(by, *, axis=0,
                      ascending=True, 
                      inplace=False, 
                      kind='quicksort', 
                      na_position='last', 
                      ignore_index=False,
                      key=None)
Sort by the values along either axis.

we can use 'by' parameter to specify column based on which sorting has to be done.

In [2]:
# eg.1 To sort value based on the ascending of the ESAL 
import pandas as pd
df=pd.read_csv('emp5.csv')
print(df)
print('-'*50)
#df.sort_values(by='ESAL',inplace=True)#  since by is positional argumnet so we can pass first argumnet without by
df.sort_values('ESAL',inplace=True)
print(df)

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600   zinny  1500  hyderabad
6  700   kinny  3500     mumbai
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
5  600   zinny  1500  hyderabad
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
6  700   kinny  3500     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata

In [3]:
# eg.2 To sort value based on the reverse of alphbets of order of ENAME 
import pandas as pd
df=pd.read_csv('emp5.csv')
print(df)
print('-'*50)

df.sort_values('ENAME',inplace=True,ascending=False) # ENAME is started with Zinny
print(df)

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600   zinny  1500  hyderabad
6  700   kinny  3500     mumbai
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
5  600   zinny  1500  hyderabad
3  400   vinny  4000      delhi
0  100   sunny  1000     mumbai
4  500   pinny  5000    kolkata
6  700   kinny  3500     mumbai
2  300  chinny  3000     mumbai
1  200   bunny  2000  hyderabad

note:
    By default NAs will be placed at the last. If we want to place NAs at first we have to use 
    df.sort_values('ENAME',inplace=True,ascending=False,na_position='first')
    
    na_position{'first','last'} default 'last'
    
    put NaNs at the begining if first, last puts NaNs at the end.

##### How to sort values of the DataFrame based on multiple columns:
    we have to provide 'by' parameter as list of  columns

eg.3 All employee records will be sorted based on alphbetical order of ENAME. if multiple employee having same ENAME, then sorting will be happenend baesd on the ascending order of ESAL for theose employee.

df.sort_values(by=['ENAME','ESAL'],inplace=True,ascending=True)

In [5]:
 
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)

df.sort_values(by=['ENAME','ESAL'],inplace=True,ascending=True)
# sunny have same name in differnt rows then it sort by its salary
print(df)

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600   zinny  1500  hyderabad
6  700   kinny  3500     mumbai
7  800   sunny  2450  hyderabad
8  900   sunny  7850  hyderabad
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
6  700   kinny  3500     mumbai
4  500   pinny  5000    kolkata
0  100   sunny  1000     mumbai
7  800   sunny  2450  hyderabad
8  900   sunny  7850  hyderabad
3  400   vinny  4000      delhi
5  600   zinny  1500  hyderabad

eg.4 All employee records will be sorted based on alphbetical order of ENAME. if multiple employee having same ENAME, then sorting will be happenend baesd on the decending order of ESAL for theose employee.

df.sort_values(by=['ENAME','ESAL'],inplace=True,ascending=False)

In [6]:
 
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)

df.sort_values(by=['ENAME','ESAL'],inplace=True,ascending=False)
# sunny have same name in differnt rows then it sort by its salary
print(df)

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600   zinny  1500  hyderabad
6  700   kinny  3500     mumbai
7  800   sunny  2450  hyderabad
8  900   sunny  7850  hyderabad
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
5  600   zinny  1500  hyderabad
3  400   vinny  4000      delhi
8  900   sunny  7850  hyderabad
7  800   sunny  2450  hyderabad
0  100   sunny  1000     mumbai
4  500   pinny  5000    kolkata
6  700   kinny  3500     mumbai
2  300  chinny  3000     mumbai
1  200   bunny  2000  hyderabad

eg.4 All employee records will be sorted based on alphbetical order of ENAME. if multiple employee having same ENAME, then sorting will be happenend for decendig for ename and ascending for esal

df.sort_values(by=['ENAME','ESAL'],inplace=True,ascending=[False,True])

In [7]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)

df.sort_values(by=['ENAME','ESAL'],inplace=True,ascending=[False,True])
# sunny have same name in differnt rows then it sort by its salary
print(df)

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600   zinny  1500  hyderabad
6  700   kinny  3500     mumbai
7  800   sunny  2450  hyderabad
8  900   sunny  7850  hyderabad
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
5  600   zinny  1500  hyderabad
3  400   vinny  4000      delhi
0  100   sunny  1000     mumbai
7  800   sunny  2450  hyderabad
8  900   sunny  7850  hyderabad
4  500   pinny  5000    kolkata
6  700   kinny  3500     mumbai
2  300  chinny  3000     mumbai
1  200   bunny  2000  hyderabad

eg.4 All employee records will be sorted based on alphbetical order of EADDR. if multiple employee having same ENAME or EADDR, then sorting will be happenend for for esal

df.sort_values(by=['EADDR','ENAME','ESAL'],inplace=True,ascending=[True,False,True])

In [8]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)

df.sort_values(by=['EADDR','ENAME','ESAL'],inplace=True,ascending=[True,False,True])

print(df)

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600   zinny  1500  hyderabad
6  700   kinny  3500     mumbai
7  800   sunny  2450  hyderabad
8  900   sunny  7850  hyderabad
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
3  400   vinny  4000      delhi
5  600   zinny  1500  hyderabad
7  800   sunny  2450  hyderabad
8  900   sunny  7850  hyderabad
1  200   bunny  2000  hyderabad
4  500   pinny  5000    kolkata
0  100   sunny  1000     mumbai
6  700   kinny  3500     mumbai
2  300  chinny  3000     mumbai

#### How to sort DataFrame based on the index:

DataFrame.sort_index(*, axis=0, 
                     level=None, 
                     ascending=True, 
                     inplace=False, 
                     kind='quicksort', 
                     na_position='last', 
                     sort_remaining=True, 
                     ignore_index=False, 
                     key=None)
Sort object by labels (along an axis).

In [10]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
df.sort_index(inplace=True,ascending=False)
print(df)

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600   zinny  1500  hyderabad
6  700   kinny  3500     mumbai
7  800   sunny  2450  hyderabad
8  900   sunny  7850  hyderabad
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
8  900   sunny  7850  hyderabad
7  800   sunny  2450  hyderabad
6  700   kinny  3500     mumbai
5  600   zinny  1500  hyderabad
4  500   pinny  5000    kolkata
3  400   vinny  4000      delhi
2  300  chinny  3000     mumbai
1  200   bunny  2000  hyderabad
0  100   sunny  1000     mumbai

#### How to rank series of values by using rank() method

In [ ]:
DataFrame.rank(axis=0, method='average',
               numeric_only=_NoDefault.no_default, 
               na_option='keep', 
               ascending=True, pct=False)

Compute numerical data ranks (1 through n) along axis.

In [13]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df['ESAL'])
print(df['ESAL'].rank())# least salary rank is 1.0 ascending
print(df['ESAL'].rank(ascending=False))# highest salary has rank 1.0 (decsnding order)

0    1000
1    2000
2    3000
3    4000
4    5000
5    1500
6    3500
7    2450
8    7850
Name: ESAL, dtype: int64
0    1.0
1    3.0
2    5.0
3    7.0
4    8.0
5    2.0
6    6.0
7    4.0
8    9.0
Name: ESAL, dtype: float64
0    9.0
1    7.0
2    5.0
3    3.0
4    2.0
5    8.0
6    4.0
7    6.0
8    1.0
Name: ESAL, dtype: float64

In [18]:
import pandas as pd
df=pd.read_csv('emp6.csv').dropna(how='all')
df['ESAL']=df['ESAL'].fillna(0).astype('int')
print(df)
#print(df['ESAL'].rank(ascending=False).astype('int'))
df['Salary Rank']=df['ESAL'].rank(ascending=False).astype('int')
print(df)

       ENO   ENAME  ESAL      EADDR
0    100.0   sunny  1000     mumbai
1    200.0   bunny  2000  hyderabad
2    300.0  chinny  3000     mumbai
3    400.0   vinny  4000      delhi
4    500.0   pinny  5000    kolkata
5    600.0   zinny  1500  hyderabad
6    700.0   kinny  3500     mumbai
7    800.0   sunny  2450  hyderabad
8    900.0   sunny  7850  hyderabad
10  1000.0   Xinny     0  Hyderabad
       ENO   ENAME  ESAL      EADDR  Salary Rank
0    100.0   sunny  1000     mumbai            9
1    200.0   bunny  2000  hyderabad            7
2    300.0  chinny  3000     mumbai            5
3    400.0   vinny  4000      delhi            3
4    500.0   pinny  5000    kolkata            2
5    600.0   zinny  1500  hyderabad            8
6    700.0   kinny  3500     mumbai            4
7    800.0   sunny  2450  hyderabad            6
8    900.0   sunny  7850  hyderabad            1
10  1000.0   Xinny     0  Hyderabad           10

In [19]:
import pandas as pd
df=pd.read_csv('emp6.csv').dropna(how='all')
df['ESAL']=df['ESAL'].fillna(0).astype('int')
print(df)
#print(df['ESAL'].rank(ascending=False).astype('int'))
df['Salary Rank']=df['ESAL'].rank(ascending=False).astype('int')
print(df)
print('-'*50)
df.sort_values(by='Salary Rank',inplace=True)
print(df)

       ENO   ENAME  ESAL      EADDR
0    100.0   sunny  1000     mumbai
1    200.0   bunny  2000  hyderabad
2    300.0  chinny  3000     mumbai
3    400.0   vinny  4000      delhi
4    500.0   pinny  5000    kolkata
5    600.0   zinny  1500  hyderabad
6    700.0   kinny  3500     mumbai
7    800.0   sunny  2450  hyderabad
8    900.0   sunny  7850  hyderabad
10  1000.0   Xinny     0  Hyderabad
       ENO   ENAME  ESAL      EADDR  Salary Rank
0    100.0   sunny  1000     mumbai            9
1    200.0   bunny  2000  hyderabad            7
2    300.0  chinny  3000     mumbai            5
3    400.0   vinny  4000      delhi            3
4    500.0   pinny  5000    kolkata            2
5    600.0   zinny  1500  hyderabad            8
6    700.0   kinny  3500     mumbai            4
7    800.0   sunny  2450  hyderabad            6
8    900.0   sunny  7850  hyderabad            1
10  1000.0   Xinny     0  Hyderabad           10
--------------------------------------------------
       ENO   ENAME  ESAL      EADDR  Salary Rank
8    900.0   sunny  7850  hyderabad            1
4    500.0   pinny  5000    kolkata            2
3    400.0   vinny  4000      delhi            3
6    700.0   kinny  3500     mumbai            4
2    300.0  chinny  3000     mumbai            5
7    800.0   sunny  2450  hyderabad            6
1    200.0   bunny  2000  hyderabad            7
5    600.0   zinny  1500  hyderabad            8
0    100.0   sunny  1000     mumbai            9
10  1000.0   Xinny     0  Hyderabad           10

#### How to filter data from DataFrame

we can filter data from DataFrame based on some condition, i.e we can select subset of rows based on some selection criteria. Internally we can use boolean masking for this filtering perpose.

Syntax:
    df[condition]
    df[boolean masking]

Q.1 select all employee record whose city is Hyderabad

In [25]:
import pandas as pd
df = pd.read_csv('emp6.csv')
print(df)
print('-'*50)
#print(df['EADDR'])
#print(df['EADDR']=='hyderabad')
print(df[df['EADDR']=='hyderabad'])

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600     Nan  1500  hyderabad
6  700   zinny  2500  hyderabad
7  800   kinny  3200     mumbai
--------------------------------------------------
   ENO  ENAME  ESAL      EADDR
1  200  bunny  2000  hyderabad
5  600    Nan  1500  hyderabad
6  700  zinny  2500  hyderabad

Q.2 select all employee record whose city is not belongs to Hyderabad

In [26]:
import pandas as pd
df = pd.read_csv('emp6.csv')
print(df)
print('-'*50)
#print(df['EADDR'])
#print(df['EADDR']=='hyderabad')
print(df[df['EADDR']!='hyderabad'])

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600     Nan  1500  hyderabad
6  700   zinny  2500  hyderabad
7  800   kinny  3200     mumbai
--------------------------------------------------
   ENO   ENAME  ESAL    EADDR
0  100   sunny  1000   mumbai
2  300  chinny  3000   mumbai
3  400   vinny  4000    delhi
4  500   pinny  5000  kolkata
7  800   kinny  3200   mumbai

Q.2 select all employee record whose salary is greater than 3000?

In [27]:
import pandas as pd
df = pd.read_csv('emp6.csv')
print(df)
print('-'*50)

print(df[df['ESAL']>3000])

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600     Nan  1500  hyderabad
6  700   zinny  2500  hyderabad
7  800   kinny  3200     mumbai
--------------------------------------------------
   ENO  ENAME  ESAL    EADDR
3  400  vinny  4000    delhi
4  500  pinny  5000  kolkata
7  800  kinny  3200   mumbai

Note:
    similarly we can use >=,<,<= operator

#### how to filter data from DataFrame based on multiple condition:

we can use( & , | ) operator to combine multiple condition together.

Q. select all employee record whose city is Hyderabad and salary is less than 2100?

In [28]:
import pandas as pd
df = pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c1=df['EADDR']=='hyderabad'
c2=df['ESAL']<2100
print(df[c1&c2])

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600     Nan  1500  hyderabad
6  700   zinny  2500  hyderabad
7  800   kinny  3200     mumbai
--------------------------------------------------
   ENO  ENAME  ESAL      EADDR
1  200  bunny  2000  hyderabad
5  600    Nan  1500  hyderabad

Q. select all employee records where either salary is greater than 3500 or eaddr is not hyderabad?

In [29]:
import pandas as pd
df = pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c1=df['EADDR']!='hyderabad'
c2=df['ESAL']>3500
print(df[c1|c2])

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600     Nan  1500  hyderabad
6  700   zinny  2500  hyderabad
7  800   kinny  3200     mumbai
--------------------------------------------------
   ENO   ENAME  ESAL    EADDR
0  100   sunny  1000   mumbai
2  300  chinny  3000   mumbai
3  400   vinny  4000    delhi
4  500   pinny  5000  kolkata
7  800   kinny  3200   mumbai

Q. select all employee records where employee should be hyderabad whose salary is >=2000 or mumbai based employee?

In [31]:
import pandas as pd
df = pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c1=df['EADDR']=='hyderabad'
c2=df['ESAL']>=2500
c3=df['EADDR']=='mumbai'
print(df[(c1&c2)|c3])

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600     Nan  1500  hyderabad
6  700   zinny  2500  hyderabad
7  800   kinny  3200     mumbai
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
2  300  chinny  3000     mumbai
6  700   zinny  2500  hyderabad
7  800   kinny  3200     mumbai

#### How to check inclusion by  using isin() method

Q. To select all employee who are belongs to hyderbad, mumbai, delhi?

1. Without using isin() method

In [34]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c1=df['EADDR']=='hyderabad'
c2=df['EADDR']=='delhi'
c3=df['EADDR']=='mumbai'
print(df[c1|c2|c3])

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600     Nan  1500  hyderabad
6  700   xinny  2500  hyderabad
7  800   kinny  3200     mumbai
8  900   zinny  5600    chennai
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
5  600     Nan  1500  hyderabad
6  700   xinny  2500  hyderabad
7  800   kinny  3200     mumbai

With isin() method

In [36]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c1=df['EADDR'].isin(['hyderabad','mumbai','delhi'])
print(df[c1])

   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
4  500   pinny  5000    kolkata
5  600     Nan  1500  hyderabad
6  700   xinny  2500  hyderabad
7  800   kinny  3200     mumbai
8  900   zinny  5600    chennai
--------------------------------------------------
   ENO   ENAME  ESAL      EADDR
0  100   sunny  1000     mumbai
1  200   bunny  2000  hyderabad
2  300  chinny  3000     mumbai
3  400   vinny  4000      delhi
5  600     Nan  1500  hyderabad
6  700   xinny  2500  hyderabad
7  800   kinny  3200     mumbai

How can we perform case sensitive comparison?
- isin() method won't provide inbuilt support for this.

In [38]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c1=df['EADDR'].str.lower().isin(['hyderabad','mumbai','delhi'])
print(df[c1])

    ENO   ENAME  ESAL      EADDR
0   100   sunny  1000     mumbai
1   200   bunny  2000  hyderabad
2   300  chinny  3000     mumbai
3   400   vinny  4000      delhi
4   500   pinny  5000    kolkata
5   600     Nan  1500  hyderabad
6   700   xinny  2500  hyderabad
7   800   kinny  3200     mumbai
8   900   zinny  5600    chennai
9  1000   mimmy  5680  hyDeraBad
--------------------------------------------------
    ENO   ENAME  ESAL      EADDR
0   100   sunny  1000     mumbai
1   200   bunny  2000  hyderabad
2   300  chinny  3000     mumbai
3   400   vinny  4000      delhi
5   600     Nan  1500  hyderabad
6   700   xinny  2500  hyderabad
7   800   kinny  3200     mumbai
9  1000   mimmy  5680  hyDeraBad

#### Case Study

Assuming we have two dataframe :
        1. employee with column : eno,ename,esal,ecity
        2. city with high pollution rate: city, pollution rate

To select all employee who are staying in cities where pollution is greater than 60?

In [44]:
import pandas as pd
cities=pd.read_csv('cities.csv')
emp=pd.read_csv('emp6.csv')
print(emp)
print(cities)
print(cities[cities['pollution rate']>60])
polluted_city=cities[cities['pollution rate']>60]['city']
print(emp[emp['EADDR'].isin(polluted_city)])

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     Nan  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900   zinny  5600   Chennai
9  1000   mimmy  5680  Hyderbad
        city  pollution rate
0      Delhi              95
1  Hyderabad              50
2     Mumbai              80
3    Chennai              30
4    Kolkata              50
     city  pollution rate
0   Delhi              95
2  Mumbai              80
   ENO   ENAME  ESAL   EADDR
0  100   sunny  1000  Mumbai
2  300  chinny  3000  Mumbai
3  400   vinny  4000   Delhi
7  800   kinny  3200  Mumbai

#### How to check for inclusion with range of value by using between() method:

To select all employee whose salary is in between >=2000 and <=5000.
To select all employee whose salary is in range (2000,5000)

Series.between(left, right, inclusive='both')

Return boolean Series equivalent to left <= series <= right.

This function returns a boolean vector containing True wherever the corresponding Series element is between the boundary values left and right. NA values are treated as False.

inclusive{“both”, “neither”, “left”, “right”}
Include boundaries. Whether to set each bound as closed or open.

In [47]:
# without using the between() method
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c1=df['ESAL']>=2000
c2=df['ESAL']<=5000
print(df[c1&c2])

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     Nan  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900   zinny  5600   Chennai
9  1000   mimmy  5680  Hyderbad
--------------------------------------------------
   ENO   ENAME  ESAL     EADDR
1  200   bunny  2000  Hyderbad
2  300  chinny  3000    Mumbai
3  400   vinny  4000     Delhi
4  500   pinny  5000   Kolkata
6  700   xinny  2500  Hyderbad
7  800   kinny  3200    Mumbai

In [50]:
# with using the between() method
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ESAL'].between(2000,5000)

print(df[c])

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     Nan  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900   zinny  5600   Chennai
9  1000   mimmy  5680  Hyderbad
--------------------------------------------------
   ENO   ENAME  ESAL     EADDR
1  200   bunny  2000  Hyderbad
2  300  chinny  3000    Mumbai
3  400   vinny  4000     Delhi
4  500   pinny  5000   Kolkata
6  700   xinny  2500  Hyderbad
7  800   kinny  3200    Mumbai

In [51]:
# with using the between() method
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ESAL'].between(2000,5000,inclusive='right')

print(df[c])

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     Nan  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900   zinny  5600   Chennai
9  1000   mimmy  5680  Hyderbad
--------------------------------------------------
   ENO   ENAME  ESAL     EADDR
2  300  chinny  3000    Mumbai
3  400   vinny  4000     Delhi
4  500   pinny  5000   Kolkata
6  700   xinny  2500  Hyderbad
7  800   kinny  3200    Mumbai

In [52]:
# with using the between() method
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ESAL'].between(2000,5000,inclusive='left')

print(df[c])

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     Nan  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900   zinny  5600   Chennai
9  1000   mimmy  5680  Hyderbad
--------------------------------------------------
   ENO   ENAME  ESAL     EADDR
1  200   bunny  2000  Hyderbad
2  300  chinny  3000    Mumbai
3  400   vinny  4000     Delhi
6  700   xinny  2500  Hyderbad
7  800   kinny  3200    Mumbai

In [54]:
# with using the between() method
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ESAL'].between(2000,5000,inclusive='neither')

print(df[c])

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     Nan  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900   zinny  5600   Chennai
9  1000   mimmy  5680  Hyderbad
--------------------------------------------------
   ENO   ENAME  ESAL     EADDR
2  300  chinny  3000    Mumbai
3  400   vinny  4000     Delhi
6  700   xinny  2500  Hyderbad
7  800   kinny  3200    Mumbai

In [55]:
# with using the between() method
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ESAL'].between(2000,5000,inclusive='both')

print(df[c])

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     Nan  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900   zinny  5600   Chennai
9  1000   mimmy  5680  Hyderbad
--------------------------------------------------
   ENO   ENAME  ESAL     EADDR
1  200   bunny  2000  Hyderbad
2  300  chinny  3000    Mumbai
3  400   vinny  4000     Delhi
4  500   pinny  5000   Kolkata
6  700   xinny  2500  Hyderbad
7  800   kinny  3200    Mumbai

#### How to check missing and non-missing value by using isnull() and notnull() methods:

1. DataFrame.isnull()

DataFrame.isnull is an alias for DataFrame.isna.
Detect missing values

2. DataFrame.notnull()

DataFrame.notnull is an alias for DataFrame.notna.
Detect existing (non-missing) values.

eg.1 To select all employee where ENAME is missing?

In [6]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ENAME'].isnull()
print(c) # giving the boolean series where NaN or missing value are there provided with the true

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     NaN  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900     NaN  5600   Chennai
9  1000   mimmy  5680  Hyderbad
--------------------------------------------------
0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8     True
9    False
Name: ENAME, dtype: bool

In [7]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ENAME'].isnull()
print(df[c]) # giving the boolean series where NaN or missing value are there provided with the true

    ENO   ENAME  ESAL     EADDR
0   100   sunny  1000    Mumbai
1   200   bunny  2000  Hyderbad
2   300  chinny  3000    Mumbai
3   400   vinny  4000     Delhi
4   500   pinny  5000   Kolkata
5   600     NaN  1500  Hyderbad
6   700   xinny  2500  Hyderbad
7   800   kinny  3200    Mumbai
8   900   zinny  5600   Chennai
9  1000   mimmy  5680  Hyderbad
--------------------------------------------------
   ENO ENAME  ESAL     EADDR
5  600   NaN  1500  Hyderbad

eg.2 To select all employee where ESAL is missing

In [8]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ESAL'].isnull() # ESAL for vinny and xinny is missing 
print(df[c])

    ENO   ENAME    ESAL     EADDR
0   100   sunny  1000.0    Mumbai
1   200   bunny  2000.0  Hyderbad
2   300  chinny  3000.0    Mumbai
3   400   vinny     NaN     Delhi
4   500   pinny  5000.0   Kolkata
5   600     NaN  1500.0  Hyderbad
6   700   xinny     NaN  Hyderbad
7   800   kinny  3200.0    Mumbai
8   900   zinny  5600.0   Chennai
9  1000   mimmy  5680.0  Hyderbad
--------------------------------------------------
   ENO  ENAME  ESAL     EADDR
3  400  vinny   NaN     Delhi
6  700  xinny   NaN  Hyderbad

eg.3 To select all employee where ENAME is not missing?

In [9]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ESAL'].notnull() # ESAL for vinny and xinny is missing so this row is deleted
print(df[c])

    ENO   ENAME    ESAL     EADDR
0   100   sunny  1000.0    Mumbai
1   200   bunny  2000.0  Hyderbad
2   300  chinny  3000.0    Mumbai
3   400   vinny     NaN     Delhi
4   500   pinny  5000.0   Kolkata
5   600     NaN  1500.0  Hyderbad
6   700   xinny     NaN  Hyderbad
7   800   kinny  3200.0    Mumbai
8   900   zinny  5600.0   Chennai
9  1000   mimmy  5680.0  Hyderbad
--------------------------------------------------
    ENO   ENAME    ESAL     EADDR
0   100   sunny  1000.0    Mumbai
1   200   bunny  2000.0  Hyderbad
2   300  chinny  3000.0    Mumbai
4   500   pinny  5000.0   Kolkata
5   600     NaN  1500.0  Hyderbad
7   800   kinny  3200.0    Mumbai
8   900   zinny  5600.0   Chennai
9  1000   mimmy  5680.0  Hyderbad

In [10]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c=df['ENAME'].notnull() # 5th row is eleminted
print(df[c])

    ENO   ENAME    ESAL     EADDR
0   100   sunny  1000.0    Mumbai
1   200   bunny  2000.0  Hyderbad
2   300  chinny  3000.0    Mumbai
3   400   vinny     NaN     Delhi
4   500   pinny  5000.0   Kolkata
5   600     NaN  1500.0  Hyderbad
6   700   xinny     NaN  Hyderbad
7   800   kinny  3200.0    Mumbai
8   900   zinny  5600.0   Chennai
9  1000   mimmy  5680.0  Hyderbad
--------------------------------------------------
    ENO   ENAME    ESAL     EADDR
0   100   sunny  1000.0    Mumbai
1   200   bunny  2000.0  Hyderbad
2   300  chinny  3000.0    Mumbai
3   400   vinny     NaN     Delhi
4   500   pinny  5000.0   Kolkata
6   700   xinny     NaN  Hyderbad
7   800   kinny  3200.0    Mumbai
8   900   zinny  5600.0   Chennai
9  1000   mimmy  5680.0  Hyderbad

eg.4 To select all employee who are belongs to Hyderabad and mumbai where ename is missing but esal is available ?

In [17]:
import pandas as pd
df=pd.read_csv('emp6.csv')
print(df)
print('-'*50)
c1=df['EADDR'].isin(['Hyderabad','Mumbai'])
c2=df['ENAME'].isnull()
c3=df['ESAL'].notnull()

print(df[c1&c2&c3])

    ENO   ENAME  ESAL      EADDR
0   100   sunny  1000     Mumbai
1   200   bunny  2000  Hyderabad
2   300  chinny  3000     Mumbai
3   400   vinny  4000      Delhi
4   500   pinny  5000    Kolkata
5   600     NaN  1500  Hyderabad
6   700   kinny  4500  Hyderabad
7   800     NaN  3200     Mumbai
8   900   zinny  5600    Chennai
9  1000   mimmy  5680  Hyderabad
--------------------------------------------------
   ENO ENAME  ESAL      EADDR
5  600   NaN  1500  Hyderabad
7  800   NaN  3200     Mumbai

#### Extracting Values fro the DataFrame

1. How to set our column as index:
     By default numerical index(in ascending order) will be generated. But we can cotomize
     1. way:
            By using index_col parameter inside read_csv() method.
     2. way:
           By using set_index() method
           df.set_index(key='ENAME',inplace=True)

In [1]:
import pandas as pd 
df=pd.read_csv('emp6.csv')
print(df)# Default Numerical Index
print('-'*50)
df1=pd.read_csv('emp6.csv',index_col='ENAME')
print(df1)

    ENO   ENAME  ESAL      EADDR
0   100   sunny  1000     Mumbai
1   200   bunny  2000  Hyderabad
2   300  chinny  3000     Mumbai
3   400   vinny  4000      Delhi
4   500   pinny  5000    Kolkata
5   600     NaN  1500  Hyderabad
6   700   kinny  4500  Hyderabad
7   800     NaN  3200     Mumbai
8   900   zinny  5600    Chennai
9  1000   mimmy  5680  Hyderabad
--------------------------------------------------
         ENO  ESAL      EADDR
ENAME
sunny    100  1000     Mumbai
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
vinny    400  4000      Delhi
pinny    500  5000    Kolkata
NaN      600  1500  Hyderabad
kinny    700  4500  Hyderabad
NaN      800  3200     Mumbai
zinny    900  5600    Chennai
mimmy   1000  5680  Hyderabad

In [3]:
import pandas as pd 
df=pd.read_csv('emp6.csv')
print(df)# Default Numerical Index
print('-'*50)
df1=pd.read_csv('emp6.csv',index_col='ENAME')
print(df1)
df2=pd.read_csv('emp6.csv')
df2.set_index(keys='ENAME',inplace=True)
print(df2)

    ENO   ENAME  ESAL      EADDR
0   100   sunny  1000     Mumbai
1   200   bunny  2000  Hyderabad
2   300  chinny  3000     Mumbai
3   400   vinny  4000      Delhi
4   500   pinny  5000    Kolkata
5   600     NaN  1500  Hyderabad
6   700   kinny  4500  Hyderabad
7   800     NaN  3200     Mumbai
8   900   zinny  5600    Chennai
9  1000   mimmy  5680  Hyderabad
--------------------------------------------------
         ENO  ESAL      EADDR
ENAME
sunny    100  1000     Mumbai
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
vinny    400  4000      Delhi
pinny    500  5000    Kolkata
NaN      600  1500  Hyderabad
kinny    700  4500  Hyderabad
NaN      800  3200     Mumbai
zinny    900  5600    Chennai
mimmy   1000  5680  Hyderabad
         ENO  ESAL      EADDR
ENAME
sunny    100  1000     Mumbai
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
vinny    400  4000      Delhi
pinny    500  5000    Kolkata
NaN      600  1500  Hyderabad
kinny    700  4500  Hyderabad
NaN      800  3200     Mumbai
zinny    900  5600    Chennai
mimmy   1000  5680  Hyderabad

#### How to reset index from custom index to default numerical index:

DataFrame.reset_index(level=None, *, drop=False, inplace=False, col_level=0, col_fill='', allow_duplicates=_NoDefault.no_default, names=None)

Reset the index, or a level of it.
Reset the index of the DataFrame, and use the default one instead. If the DataFrame has a MultiIndex, this method can remove one or more levels.

In [6]:
import pandas as pd 
df=pd.read_csv('emp6.csv',index_col='ENAME')
print(df)
df.reset_index(inplace=True)
print(df)

         ENO  ESAL      EADDR
ENAME
sunny    100  1000     Mumbai
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
vinny    400  4000      Delhi
pinny    500  5000    Kolkata
NaN      600  1500  Hyderabad
kinny    700  4500  Hyderabad
NaN      800  3200     Mumbai
zinny    900  5600    Chennai
mimmy   1000  5680  Hyderabad
    ENAME   ENO  ESAL      EADDR
0   sunny   100  1000     Mumbai
1   bunny   200  2000  Hyderabad
2  chinny   300  3000     Mumbai
3   vinny   400  4000      Delhi
4   pinny   500  5000    Kolkata
5     NaN   600  1500  Hyderabad
6   kinny   700  4500  Hyderabad
7     NaN   800  3200     Mumbai
8   zinny   900  5600    Chennai
9   mimmy  1000  5680  Hyderabad

In [7]:
import pandas as pd 
df=pd.read_csv('emp6.csv',index_col='ENAME')
print(df)
df.reset_index(drop=True, inplace=True) # Data loss and not recomended 
print(df)

         ENO  ESAL      EADDR
ENAME
sunny    100  1000     Mumbai
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
vinny    400  4000      Delhi
pinny    500  5000    Kolkata
NaN      600  1500  Hyderabad
kinny    700  4500  Hyderabad
NaN      800  3200     Mumbai
zinny    900  5600    Chennai
mimmy   1000  5680  Hyderabad
    ENO  ESAL      EADDR
0   100  1000     Mumbai
1   200  2000  Hyderabad
2   300  3000     Mumbai
3   400  4000      Delhi
4   500  5000    Kolkata
5   600  1500  Hyderabad
6   700  4500  Hyderabad
7   800  3200     Mumbai
8   900  5600    Chennai
9  1000  5680  Hyderabad

#### How to select rows in index label with loc[] indexer:
     1.  df.loc[index_label]
     2.  df.loc[begin_index_label:end_index_label:step] -- slice operator
     3.  df.loc[[index_label1,index_label2...]]

In [9]:
import pandas as pd 
df=pd.read_csv('emp6.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.loc['bunny']) # return in the form of series for single intity

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
ENO            200
ESAL          2000
EADDR    Hyderabad
Name: bunny, dtype: object

In [10]:
import pandas as pd 
df=pd.read_csv('emp6.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.loc['sunny'])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
ENO         100
ESAL       1000
EADDR    Mumbai
Name: sunny, dtype: object

In [17]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.loc['chinny':'sunny'])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
         ENO  ESAL      EADDR
ENAME
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai

In [19]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.loc[:'zinny'])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai

In [21]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.loc[['zinny','bunny','sunny']])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
        ENO  ESAL      EADDR
ENAME
zinny   900  5600    Chennai
bunny   200  2000  Hyderabad
sunny   100  1000     Mumbai
sunny  1100  1800     Mumbai
sunny  1200  2500     Mumbai

#### How to access rows of data frame by using index position:
     1. df.iloc[index_position]
     2. df.iloc[begin_index_position:end_index_position:step]
     3. df.iloc[[index_position1,index_position2....]]

In [23]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.iloc[0])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
ENO            200
ESAL          2000
EADDR    Hyderabad
Name: bunny, dtype: object

In [24]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.iloc[0:2])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
        ENO  ESAL      EADDR
ENAME
bunny   200  2000  Hyderabad
chinny  300  3000     Mumbai

In [25]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.iloc[[0,2,4,6]])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
        ENO  ESAL      EADDR
ENAME
bunny   200  2000  Hyderabad
kinny   700  4500  Hyderabad
pinny   500  5000    Kolkata
sunny  1100  1800     Mumbai

#### How to get value of the required cells :
   1. df.loc[index_lable,column_name]
   2. df.iloc[index_position,column_name]

In [27]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.loc['pinny','ESAL'])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
5000

In [28]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
df.loc[['bunny','vinny'],['ESAL','EADDR']]

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------

       ESAL      EADDR
ENAME
bunny  2000  Hyderabad
vinny  4000      Delhi

In [29]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.iloc[0,0])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
200

In [30]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.iloc[[0,3],[1,2]])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
       ESAL      EADDR
ENAME
bunny  2000  Hyderabad
mimmy  5680  Hyderabad

In [31]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
print(df.iloc[3:,:2])

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
        ENO  ESAL
ENAME
mimmy  1000  5680
pinny   500  5000
sunny   100  1000
sunny  1100  1800
sunny  1200  2500
vinny   400  4000
zinny   900  5600
NaN     600  1500
NaN     800  3200

#### How to set new values for the specific cells:
     1. df.loc[index_lable,clolumn_name]=new_value/list of new_values
     2. df.iloc[index_position,column_name]=new_value/list of new_values

In [34]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
df.loc['bunny','ESAL']=7777
print(df.loc['bunny'])
print('-'*50)
print(df)

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
ENO            200
ESAL          7777
EADDR    Hyderabad
Name: bunny, dtype: object
--------------------------------------------------
         ENO  ESAL      EADDR
ENAME
bunny    200  7777  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai

In [39]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
df.loc[['bunny','chinny','vinny'],'EADDR']='pune'
print('-'*50)
print(df)

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
--------------------------------------------------
         ENO  ESAL      EADDR
ENAME
bunny    200  2000       pune
chinny   300  3000       pune
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000       pune
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai

In [40]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
df.loc[['bunny','chinny','vinny'],'EADDR']=['Acity','Bcity','Ccity']
print('-'*50)
print(df)

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
--------------------------------------------------
         ENO  ESAL      EADDR
ENAME
bunny    200  2000      Acity
chinny   300  3000      Bcity
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Ccity
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai

In [42]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
c=df['EADDR']=='Hyderabad'
print(df.loc[c])
df.loc[c,'EADDR']='Cyberabad'
print(df)

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
        ENO  ESAL      EADDR
ENAME
bunny   200  2000  Hyderabad
kinny   700  4500  Hyderabad
mimmy  1000  5680  Hyderabad
NaN     600  1500  Hyderabad
         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Cyberabad
chinny   300  3000     Mumbai
kinny    700  4500  Cyberabad
mimmy   1000  5680  Cyberabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Cyberabad
NaN      800  3200     Mumbai

#### How to rename index lable and column name in DataFrame:

#### How to filter DataFrame with Query() method:
     we can use query() method to filter rows DataFrame. It is most commonly used method in pandas.

DataFrame.query(expr, *, inplace=False, **kwargs)

Query the columns of a DataFrame with a boolean expression.

##### without using query method:

In [43]:
import pandas as pd 
df=pd.read_csv('emp7.csv',index_col='ENAME')
df.sort_index(inplace=True)
print(df)
print('-'*50)
c=df['EADDR']=='Hyderabad'
print(df.loc[c])
print(df)

         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai
--------------------------------------------------
        ENO  ESAL      EADDR
ENAME
bunny   200  2000  Hyderabad
kinny   700  4500  Hyderabad
mimmy  1000  5680  Hyderabad
NaN     600  1500  Hyderabad
         ENO  ESAL      EADDR
ENAME
bunny    200  2000  Hyderabad
chinny   300  3000     Mumbai
kinny    700  4500  Hyderabad
mimmy   1000  5680  Hyderabad
pinny    500  5000    Kolkata
sunny    100  1000     Mumbai
sunny   1100  1800     Mumbai
sunny   1200  2500     Mumbai
vinny    400  4000      Delhi
zinny    900  5600    Chennai
NaN      600  1500  Hyderabad
NaN      800  3200     Mumbai

##### with query method

##### Important points 
1. expr paramter value should be valid string
2. The column names should not contain spaces

In [52]:
# using query method:
import pandas as pd
df=pd.read_csv('emp7.csv')
print(df)
print('-'*50)
df.query('EADDR=="Hyderabad"',inplace=True)
print(df)

     ENO   ENAME  ESAL      EADDR
0    100   sunny  1000     Mumbai
1    200   bunny  2000  Hyderabad
2    300  chinny  3000     Mumbai
3    400   vinny  4000      Delhi
4    500   pinny  5000    Kolkata
5    600     NaN  1500  Hyderabad
6    700   kinny  4500  Hyderabad
7    800     NaN  3200     Mumbai
8    900   zinny  5600    Chennai
9   1000   mimmy  5680  Hyderabad
10  1100   sunny  1800     Mumbai
11  1200   sunny  2500     Mumbai
--------------------------------------------------
    ENO  ENAME  ESAL      EADDR
1   200  bunny  2000  Hyderabad
5   600    NaN  1500  Hyderabad
6   700  kinny  4500  Hyderabad
9  1000  mimmy  5680  Hyderabad

In [53]:
# using query method:
import pandas as pd
df=pd.read_csv('emp7.csv')
print(df)
print('-'*50)
df.query('EADDR!="Hyderabad"',inplace=True)
print(df)

     ENO   ENAME  ESAL      EADDR
0    100   sunny  1000     Mumbai
1    200   bunny  2000  Hyderabad
2    300  chinny  3000     Mumbai
3    400   vinny  4000      Delhi
4    500   pinny  5000    Kolkata
5    600     NaN  1500  Hyderabad
6    700   kinny  4500  Hyderabad
7    800     NaN  3200     Mumbai
8    900   zinny  5600    Chennai
9   1000   mimmy  5680  Hyderabad
10  1100   sunny  1800     Mumbai
11  1200   sunny  2500     Mumbai
--------------------------------------------------
     ENO   ENAME  ESAL    EADDR
0    100   sunny  1000   Mumbai
2    300  chinny  3000   Mumbai
3    400   vinny  4000    Delhi
4    500   pinny  5000  Kolkata
7    800     NaN  3200   Mumbai
8    900   zinny  5600  Chennai
10  1100   sunny  1800   Mumbai
11  1200   sunny  2500   Mumbai

In [54]:
# using query method:
import pandas as pd
df=pd.read_csv('emp7.csv')
print(df)
print('-'*50)
df.query('ESAL>1500',inplace=True)
print(df)

     ENO   ENAME  ESAL      EADDR
0    100   sunny  1000     Mumbai
1    200   bunny  2000  Hyderabad
2    300  chinny  3000     Mumbai
3    400   vinny  4000      Delhi
4    500   pinny  5000    Kolkata
5    600     NaN  1500  Hyderabad
6    700   kinny  4500  Hyderabad
7    800     NaN  3200     Mumbai
8    900   zinny  5600    Chennai
9   1000   mimmy  5680  Hyderabad
10  1100   sunny  1800     Mumbai
11  1200   sunny  2500     Mumbai
--------------------------------------------------
     ENO   ENAME  ESAL      EADDR
1    200   bunny  2000  Hyderabad
2    300  chinny  3000     Mumbai
3    400   vinny  4000      Delhi
4    500   pinny  5000    Kolkata
6    700   kinny  4500  Hyderabad
7    800     NaN  3200     Mumbai
8    900   zinny  5600    Chennai
9   1000   mimmy  5680  Hyderabad
10  1100   sunny  1800     Mumbai
11  1200   sunny  2500     Mumbai

In [63]:
### all the employee with add of hyderabad and esal is greater than 1500 ?

import pandas as pd
df=pd.read_csv('emp7.csv')
print(df)
print('-'*50)
#df.query('EADDR=="Hyderabad" and ESAL>1500',inplace=True)
df.query('EADDR=="Hyderabad" & ESAL>1500',inplace=True)

print(df)

     ENO   ENAME  ESAL      EADDR
0    100   sunny  1000     Mumbai
1    200   bunny  2000  Hyderabad
2    300  chinny  3000     Mumbai
3    400   vinny  4000      Delhi
4    500   pinny  5000    Kolkata
5    600     NaN  1500  Hyderabad
6    700   kinny  4500  Hyderabad
7    800     NaN  3200     Mumbai
8    900   zinny  5600    Chennai
9   1000   mimmy  5680  Hyderabad
10  1100   sunny  1800     Mumbai
11  1200   sunny  2500     Mumbai
--------------------------------------------------
    ENO  ENAME  ESAL      EADDR
1   200  bunny  2000  Hyderabad
6   700  kinny  4500  Hyderabad
9  1000  mimmy  5680  Hyderabad

### all the employee with addr not from hyderabad and esal is less than 4000  ?

In [61]:
import pandas as pd
df=pd.read_csv('emp7.csv')
print(df)
print('-'*50)
#df.query('EADDR!="Hyderabad" or ESAL<4000',inplace=True)
df.query('EADDR!="Hyderabad" | ESAL<4000',inplace=True)

print(df)

     ENO   ENAME  ESAL      EADDR
0    100   sunny  1000     Mumbai
1    200   bunny  2000  Hyderabad
2    300  chinny  3000     Mumbai
3    400   vinny  4000      Delhi
4    500   pinny  5000    Kolkata
5    600     NaN  1500  Hyderabad
6    700   kinny  4500  Hyderabad
7    800     NaN  3200     Mumbai
8    900   zinny  5600    Chennai
9   1000   mimmy  5680  Hyderabad
10  1100   sunny  1800     Mumbai
11  1200   sunny  2500     Mumbai
--------------------------------------------------
     ENO   ENAME  ESAL      EADDR
0    100   sunny  1000     Mumbai
1    200   bunny  2000  Hyderabad
2    300  chinny  3000     Mumbai
3    400   vinny  4000      Delhi
4    500   pinny  5000    Kolkata
5    600     NaN  1500  Hyderabad
7    800     NaN  3200     Mumbai
8    900   zinny  5600    Chennai
10  1100   sunny  1800     Mumbai
11  1200   sunny  2500     Mumbai